DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool loadDeviceAuthToken() {
  deviceAuthToken = "";
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceAuthTokenPath)) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "r");
  if (!file) {
    return false;
  }
  String token = file.readString();
  file.close();
  token.trim();
  if (!validAuthToken(token)) {
    return false;
  }
  deviceAuthToken = token;
  return true;
}

bool saveDeviceAuthToken(const String& token) {
  if (!validAuthToken(token) || !LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "w");
  if (!file) {
    return false;
  }
  file.print(token);
  file.close();
  deviceAuthToken = token;
  return true;
}

bool deviceAuthConfigured() {
  return deviceAuthToken.length() > 0;
}

String requestAuthToken() {
  String token = webServer.header(kDeviceAuthHeader);
  token.trim();
  if (token.length() == 0) {
    token = webServer.arg("token");
    token.trim();
  }
  return token;
}

bool requestHasValidAuth() {
  if (!deviceAuthConfigured()) {
    return true;
  }
  return requestAuthToken() == deviceAuthToken;
}

bool requestHasCurrentDeviceToken() {
  return deviceAuthConfigured() && requestAuthToken() == deviceAuthToken;
}

bool requestHasValidOtaAuth() {
  return codexbar_display::esp8266::WifiSecurityPolicy::AllowsFirmwareUpload(
      deviceAuthConfigured(),
      requestHasCurrentDeviceToken());
}

bool authorizeWifiCredentialWrite() {
  if (codexbar_display::esp8266::WifiSecurityPolicy::AllowsCredentialWrite(
          setupMode,
          deviceAuthConfigured(),
          requestHasCurrentDeviceToken())) {
    return true;
  }
  addCorsHeaders();
  if (deviceAuthConfigured()) {
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  } else {
    webServer.send(403, "text/plain; charset=utf-8", "physical setup confirmation required");
  }
  return false;
}

bool requireWriteAuth() {
  if (requestHasValidAuth()) {
    return true;
  }
  addCorsHeaders();
  webServer.sendHeader("WWW-Authenticate", "VibeTV token");
  webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  return false;
}

void appendAuthStatusJSON(String& out) {
  out += "\"auth\":{\"paired\":";
  out += deviceAuthConfigured() ? "true" : "false";
  out += ",\"tokenHeader\":\"";
  out += kDeviceAuthHeader;
  out += "\"}";
}

void appendBrightnessCapabilityJSON(String& out) {
  out += "{\"supported\":";
  out += renderer.SupportsBrightnessControl() ? "true" : "false";
  out += "}";
}

void appendSettingsJSON(String& out) {
  out += "\"settings\":{\"display\":{\"brightnessPercent\":";
  out += String(deviceSettings.brightnessPercent);
  out += "}}";
}

// Clock state is a diagnostic: it must show whether the displayed time is the
// device's own, a still-current Companion string, or nothing trustworthy.
void appendClockJSON(String& out) {
  const unsigned long nowMs = millis();
  char timeText[deviceclock::kTimeTextSize];
  char dateText[deviceclock::kDateTextSize];
  const deviceclock::Source source =
      codexbar_display::app::ClockTimeText(runtimeCtx, nowMs, timeText, sizeof(timeText));
  codexbar_display::app::ClockDateText(runtimeCtx, nowMs, dateText, sizeof(dateText));

  out += "\"clock\":{\"synced\":";
  out += runtimeCtx.clock.synced ? "true" : "false";
  out += ",\"source\":\"";
  out += deviceclock::SourceName(source);
  out += "\",\"epoch\":";
  out += String(static_cast<long>(deviceclock::UtcNow(runtimeCtx.clock, nowMs)));
  out += ",\"utcOffsetMinutes\":";
  if (runtimeCtx.clock.hasUtcOffset) {
    out += String(static_cast<int>(runtimeCtx.clock.utcOffsetMinutes));
  } else {
    out += "null";
  }
  out += ",\"lastSyncAgeMs\":";
  if (runtimeCtx.clock.synced) {
    out += String(nowMs - runtimeCtx.clock.syncMillis);
  } else {
    out += "null";
  }
  out += ",\"syncCount\":";
  out += String(runtimeCtx.clock.syncCount);
  out += ",\"time\":\"";
  out += timeText;
  out += "\",\"date\":\"";
  out += dateText;
  out += "\"},";
}

void markFirmwareUpdateNoticeDirty() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  if (!codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
    return;
  }
  if (!runtimeCtx.screenDirty && !waitStatusRendered && !frameStaleStatusRendered) {
    firmwareUpdateNoticeDirty = true;
  } else {
    runtimeCtx.screenDirty = true;
  }
}

bool shouldShowFirmwareUpdateNotice() {
  return firmwareUpdate.noticeEnabled &&
         firmwareUpdate.notice.visible &&
         !setupMode &&
         !waitStatusRendered &&
         !frameStaleStatusRendered &&
         codexbar_display::app::HasFrame(runtimeCtx) &&
         codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec &&
         !codexbar_display::app::CurrentFrame(runtimeCtx).hasError;
}

const char* currentFirmwareUpdateNoticeText() {
  switch (codexbar_display::updatenotice::CurrentPhase(firmwareUpdate.notice)) {
    case codexbar_display::updatenotice::Phase::Available:
      return kFirmwareUpdateAvailableText;
    case codexbar_display::updatenotice::Phase::MacApp:
      return kFirmwareUpdateMacAppText;
    case codexbar_display::updatenotice::Phase::Provider:
      break;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (runtimeCtx.topLineOverride.length()) {
    return runtimeCtx.topLineOverride.c_str();
  }
  if (frame.label.length()) {
    return frame.label.c_str();
  }
  if (frame.provider.length()) {
    return frame.provider.c_str();
  }
  return "Provider";
}

void drawFirmwareUpdateNotice() {
  if (!shouldShowFirmwareUpdateNotice()) {
    firmwareUpdateNoticeDirty = false;
    return;
  }
  renderer.DrawFirmwareUpdateNotice(runtimeCtx, currentFirmwareUpdateNoticeText());
  firmwareUpdateNoticeDirty = false;
}

void restoreFirmwareUpdateNoticeSurface() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError ||
      waitStatusRendered ||
      frameStaleStatusRendered) {
    return;
  }
  if (!renderer.ClearFirmwareUpdateNoticeSurface(runtimeCtx)) {
    runtimeCtx.screenDirty = true;
  }
}

