DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void clearFirmwareUpdateNotice() {
  const codexbar_display::updatenotice::TickResult result =
      codexbar_display::updatenotice::Deactivate(firmwareUpdate.notice);
  firmwareUpdateNoticeDirty = false;
  if (result.restore) {
    restoreFirmwareUpdateNoticeSurface();
  }
}

void maintainFirmwareUpdateNotice() {
  if (!firmwareUpdate.noticeEnabled ||
      setupMode ||
      frameStaleStatusRendered ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    clearFirmwareUpdateNotice();
    return;
  }

  const unsigned long nowMs = millis();
  // Surface detection walks the ThemeSpec, so re-check it at most once per
  // second: once to activate the notice, afterwards to follow theme changes.
  if (firmwareUpdate.noticeSurfaceCheckedAtMs == 0 ||
      (nowMs - firmwareUpdate.noticeSurfaceCheckedAtMs) >= kFirmwareUpdateSurfaceRecheckMs) {
    firmwareUpdate.noticeSurfaceCheckedAtMs = nowMs == 0 ? 1 : nowMs;
    const codexbar_display::updatenotice::TickResult activated =
        codexbar_display::updatenotice::Activate(
            firmwareUpdate.notice, renderer.FirmwareUpdateNoticeSurface(runtimeCtx), nowMs);
    if (activated.restore) {
      restoreFirmwareUpdateNoticeSurface();
    }
    if (activated.draw) {
      markFirmwareUpdateNoticeDirty();
    }
  }

  codexbar_display::updatenotice::Config config;
  config.phaseToggleMs = kFirmwareUpdateNoticeToggleMs;
  config.overlayVisibleMs = kFirmwareUpdateOverlayVisibleMs;
  config.overlayHiddenMs = kFirmwareUpdateOverlayHiddenMs;
  const codexbar_display::updatenotice::TickResult ticked =
      codexbar_display::updatenotice::Tick(firmwareUpdate.notice, config, nowMs);
  if (ticked.restore) {
    restoreFirmwareUpdateNoticeSurface();
  }
  if (ticked.draw) {
    markFirmwareUpdateNoticeDirty();
  }
}

void applyFrameUpdateState() {
  if (!codexbar_display::app::HasFrame(runtimeCtx)) {
    return;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (!frame.hasUpdateAvailable) {
    firmwareUpdate.noticeEnabled = false;
    clearFirmwareUpdateNotice();
    return;
  }

  String nextStatus = frame.updateStatus;
  if (nextStatus.length() == 0) {
    nextStatus = frame.updateAvailable ? "update_available" : "current";
  }
  const bool changed = firmwareUpdate.available != frame.updateAvailable ||
                       firmwareUpdate.latestVersion != frame.updateLatestVersion ||
                       firmwareUpdate.lastStatus != nextStatus ||
                       firmwareUpdate.lastError != frame.updateLastError;
  firmwareUpdate.available = frame.updateAvailable;
  firmwareUpdate.latestVersion = frame.updateLatestVersion;
  firmwareUpdate.lastError = frame.updateLastError;
  firmwareUpdate.lastCheckedAtMs = millis();
  firmwareUpdate.nextCheckAtMs = 0;
  firmwareUpdate.lastStatus = nextStatus;

  if (!firmwareUpdate.available) {
    firmwareUpdate.noticeEnabled = false;
    clearFirmwareUpdateNotice();
    return;
  }
  if (changed) {
    // Restart the notice cycle for a new update state; the next maintain pass
    // re-activates it on the current theme's surface.
    clearFirmwareUpdateNotice();
    firmwareUpdate.noticeSurfaceCheckedAtMs = 0;
  }
  firmwareUpdate.noticeEnabled = true;
}

void drawWaitingForCompanionStatus() {
  String stationIp = WiFi.localIP().toString();
  if (WiFi.status() != WL_CONNECTED ||
      !codexbar_display::esp8266::ConnectedSetupPolicy::IsStationIPv4(stationIp.c_str())) {
    stationIp = "";
  }
  const unsigned long renderStartUs = micros();
  renderer.DrawConnectedSetupInstructions(runtimeCtx, kCustomerAppHost, stationIp);
  recordRenderFull("connected_setup", micros() - renderStartUs);
  lastConnectedSetupIp = stationIp;
  waitStatusRendered = true;
}

void drawWifiConnectingStatus(const String& ssid) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Connecting WiFi", ssid);
  recordRenderFull("status", micros() - renderStartUs);
}

void drawWifiResetStatus(const String& line2) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV RESET", "WiFi reset", line2);
  recordRenderFull("status", micros() - renderStartUs);
}

void drawUpdateStatus(const String& line2) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV UPDATE", "Update running", line2);
  recordRenderFull("update_status", micros() - renderStartUs);
}

bool statusScreenLocked() {
  return otaUploadInProgress || rebootPending;
}

void resetWifiReconnectState() {
  wifiDisconnectedAtMs = 0;
  wifiReconnectAttemptAtMs = 0;
  wifiReconnectStatusRendered = false;
}

String displayErrorMessage(const String& message) {
  if (message == "runtime/codexbar-version" || message == "runtime/codexbar-parse") {
    return "Update Mac App";
  }
  if (message == "runtime/codexbar-binary") {
    return "Install Mac App";
  }
  if (message == "runtime/no-providers") {
    return "Open App";
  }
  if (message == "runtime/codexbar-cmd") {
    return "Open App";
  }
  if (message == "runtime/cycle-timeout") {
    return "Open App";
  }
  return "Open App";
}

void renderAcceptedFrame(const codexbar_display::core::SerialConsumeEvent& event) {
  const bool maybeThemeSpecPartial = event.themeSpecPartialRender && !runtimeCtx.screenDirty;
  const unsigned long partialStartUs = maybeThemeSpecPartial ? micros() : 0;
  const unsigned long partialSuccessesBefore =
      maybeThemeSpecPartial ? renderer.DebugSnapshot().themeSpecPartialSuccesses : 0;
  renderer.OnFrameAccepted(runtimeCtx, event);
  if (shouldShowFirmwareUpdateNotice()) {
    // A frame-driven partial repaint may have painted theme content over the
    // visible notice (label line or overlay bar); re-assert it next loop.
    markFirmwareUpdateNoticeDirty();
  }
  if (maybeThemeSpecPartial) {
    const codexbar_display::esp8266::RendererDebugSnapshot snapshot = renderer.DebugSnapshot();
    if (snapshot.themeSpecPartialSuccesses > partialSuccessesBefore && !runtimeCtx.screenDirty) {
      recordRenderPartial("theme_spec_frame", micros() - partialStartUs);
    }
  }
}

// The device clock owns {time}/{date}. SNTP corrects the system clock on its
// own once the link is up, so this only samples it and repaints when the text
// the customer sees actually changes. That covers the device clock, the
// Companion fallback and the honest placeholder with one trigger.
void maintainDeviceClock() {
  const unsigned long nowMs = millis();
  if (static_cast<long>(nowMs - nextDeviceClockPollAtMs) < 0) {
    return;
  }
  nextDeviceClockPollAtMs = nowMs + kDeviceClockPollMs;

  const time_t systemEpoch = time(nullptr);
  if (deviceclock::ObserveSystemEpoch(runtimeCtx.clock, static_cast<int64_t>(systemEpoch), nowMs)) {
    Serial.printf("clock_synced epoch=%ld utc_offset_known=%d\n",
                  static_cast<long>(systemEpoch),
                  runtimeCtx.clock.hasUtcOffset ? 1 : 0);
  }

  char timeText[deviceclock::kTimeTextSize];
  char dateText[deviceclock::kDateTextSize];
  codexbar_display::app::ClockTimeText(runtimeCtx, nowMs, timeText, sizeof(timeText));
  codexbar_display::app::ClockDateText(runtimeCtx, nowMs, dateText, sizeof(dateText));
  if (strcmp(timeText, renderedClockTime) == 0 && strcmp(dateText, renderedClockDate) == 0) {
    return;
  }
  strcpy(renderedClockTime, timeText);
  strcpy(renderedClockDate, dateText);

