DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  if (setupMode ||
      waitStatusRendered ||
      frameStaleStatusRendered ||
      runtimeCtx.screenDirty ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  const unsigned long renderStartUs = micros();
  if (renderer.DrawClock(runtimeCtx)) {
    recordRenderPartial("clock", micros() - renderStartUs);
  }
}

void markFrameAccepted(const codexbar_display::core::SerialConsumeEvent& event, const char* transport) {
  if (statusScreenLocked()) {
    Serial.printf("frame_ignored transport=%s reason=status_screen_locked\n", transport);
    return;
  }

  const bool redrawAfterStatus = waitStatusRendered || frameStaleStatusRendered;
  waitStatusRendered = false;
  frameStaleStatusRendered = false;
  if (redrawAfterStatus) {
    // A setup or OTA status screen covers the whole display. Never apply a
    // partial ThemeSpec update on top of it; the first accepted frame must
    // rebuild the complete customer screen.
    runtimeCtx.screenDirty = true;
  }
  lastFrameAcceptedAtMs = millis();
  // SNTP delivers UTC only. The Mac is the only local-offset source the device
  // has, so learn it while the Mac is here and persist it for the next boot.
  if (deviceclock::ObserveCompanionClock(
          runtimeCtx.clock,
          codexbar_display::app::CurrentFrame(runtimeCtx).timeText.c_str(),
          lastFrameAcceptedAtMs)) {
    Serial.printf("clock_utc_offset_learned minutes=%d\n",
                  static_cast<int>(runtimeCtx.clock.utcOffsetMinutes));
    saveDeviceSettings();
  }
  applyFrameUpdateState();
  if (event.themeSpecChanged) {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
    if (codexbar_display::app::HasFrame(runtimeCtx) &&
        codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
      const String& raw = codexbar_display::app::CurrentFrame(runtimeCtx).themeSpecRaw;
      if (raw.length() > 0) {
        activeThemeSpecHash = hashHex8(raw);
      }
    } else {
      activeThemeSpecPath = "";
      activeThemeSpecHash = "";
    }
#else
    activeThemeSpecPath = "";
    activeThemeSpecHash = "";
#endif
  }

  const bool wifiTransport = transport != nullptr && strcmp(transport, "wifi") == 0;
  if (wifiTransport && event.visualChanged) {
    // ESP8266WebServer invokes this from handleClient(). Keep all display work
    // out of that callback; the event is consumed before any new frame can
    // replace the runtime state at the start of the next loop.
    pendingWifiRenderEvent = event;
    pendingWifiRender = true;
  } else if (!wifiTransport) {
    renderAcceptedFrame(event);
  }
  Serial.printf("frame_received transport=%s\n", transport);
}

const char* transportCapabilitiesJSON(const char* activeTransport, bool compact = false) {
  const bool isUsb = activeTransport != nullptr && strcmp(activeTransport, "usb") == 0;
  static String json;
  json = "{\"display\":{";
  if (!compact) {
    json += "\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16,";
  }
  json += "\"brightness\":";
  appendBrightnessCapabilityJSON(json);
  json += "},\"theme\":";
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  json += themeCapabilitiesJSON(false, compact);
#else
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  json += themeCapabilitiesJSON(true, compact);
#else
  json += themeCapabilitiesJSON(false, compact);
#endif
#endif
  json += ",";
  appendAuthStatusJSON(json);
  json += ",\"transport\":{\"active\":\"";
  json += isUsb ? "usb" : "wifi";
  json += "\",\"supported\":[\"usb\",\"wifi\"]}}";
  return json.c_str();
}

codexbar_display::app::TransportConfig makeTransportConfig(const char* activeTransport) {
  codexbar_display::app::TransportConfig config;
  config.boardId = CODEXBAR_DISPLAY_BOARD_ID;
  config.firmwareVersion = CODEXBAR_DISPLAY_FW_VERSION;
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  config.featuresJSON = "[]";
#else
  config.featuresJSON = kThemeFeatureJSON;
#endif
  config.capabilitiesJSON = transportCapabilitiesJSON(activeTransport);
  config.maxFrameBytes = kMaxFrameBytes;
  return config;
}

String htmlEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length());
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '&':
        escaped += "&amp;";
        break;
      case '<':
        escaped += "&lt;";
        break;
      case '>':
        escaped += "&gt;";
        break;
      case '"':
        escaped += "&quot;";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

String macInstallerCommand() {
  return F("curl -fsSL https://github.com/DreamyTalesPAN/CodexBar-Display/releases/latest/download/install.sh | bash");
}

String updateTargetURL() {
  return String("http://") + WiFi.localIP().toString();
}

String updateInstallCommand() {
  const String target = updateTargetURL();
  String command;
  command.reserve(260);
  command += macInstallerCommand();
  command += F(" -s -- --target ");
  command += target;
  command += F(" && codexbar-display install-update --confirm-live-update --target ");
  command += target;
  return command;
}

String updateStatusHTML(bool compact) {
  String html;
  html.reserve(700);
  if (firmwareUpdate.available) {
    html += compact ? F("<div class='update'>") : F("<section class='update'>");
    html += F("<strong>Firmware update available</strong>");
    html += F("<span>Installed: <code>");
    html += htmlEscape(String(CODEXBAR_DISPLAY_FW_VERSION));
    html += F("</code>");
    if (firmwareUpdate.latestVersion.length() > 0) {
      html += F(" / Latest: <code>");
      html += htmlEscape(firmwareUpdate.latestVersion);
      html += F("</code>");
    }
    html += F("</span><a class='update-link' href='/update'>Install update</a>");
    html += compact ? F("</div>") : F("</section>");
    return html;
  }

  if (!compact) {
    html += F("<section><h2>Firmware status</h2><p class='muted'>Installed: <code>");
    html += htmlEscape(String(CODEXBAR_DISPLAY_FW_VERSION));
    html += F("</code>");
    html += F("<br>Status: <code>");
    html += htmlEscape(firmwareUpdate.lastStatus);
    html += F("</code>");
    if (firmwareUpdate.lastError.length() > 0) {
      html += F("<br>Last check error: <code>");
      html += htmlEscape(firmwareUpdate.lastError);
      html += F("</code>");
    }
    html += F("</p></section>");
  }
  return html;
}

bool readWifiCredentials(WifiCredentials& creds) {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(0, magic);
  if (magic != kWifiCredsMagic) {
    return false;
  }

  for (size_t i = 0; i < kWifiSsidBytes; ++i) {
    creds.ssid[i] = static_cast<char>(EEPROM.read(4 + i));
  }
  creds.ssid[kWifiSsidBytes - 1] = '\0';
  for (size_t i = 0; i < kWifiPasswordBytes; ++i) {
    creds.password[i] = static_cast<char>(EEPROM.read(4 + kWifiSsidBytes + i));
  }
  creds.password[kWifiPasswordBytes - 1] = '\0';
  return String(creds.ssid).length() > 0;
}

bool saveWifiCredentials(const String& ssid, const String& password) {
  EEPROM.begin(kEepromBytes);
  EEPROM.put(0, kWifiCredsMagic);
  for (size_t i = 0; i < kWifiSsidBytes; ++i) {
    EEPROM.write(4 + i, i < ssid.length() ? ssid.charAt(i) : 0);
  }
  for (size_t i = 0; i < kWifiPasswordBytes; ++i) {
    EEPROM.write(4 + kWifiSsidBytes + i, i < password.length() ? password.charAt(i) : 0);
  }
  // Clear any marker left by 1.0.38. New firmware never needs a physical
  // pairing window, but the bytes stay reserved for storage compatibility.
  EEPROM.put(kLegacyPairingMarkerOffset, static_cast<uint32_t>(0));
  return EEPROM.commit();
}

void clearWifiCredentials() {
  EEPROM.begin(kEepromBytes);
  for (size_t i = 0; i < kWifiCredsBytes; ++i) {
    EEPROM.write(i, 0);
  }
  EEPROM.commit();
  Serial.println("wifi_credentials_cleared");
}

void clearSdkWifiCredentials() {
  WiFi.persistent(true);
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true);
  delay(150);
  WiFi.persistent(false);
  Serial.println("wifi_sdk_credentials_cleared");
}

uint32_t incrementBootResetCounter() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  uint32_t counter = 0;
  EEPROM.get(kBootDiagnosticsOffset, magic);
  if (magic == kBootDiagnosticsMagic) {
    EEPROM.get(kBootResetCounterOffset, counter);
  }
  if (counter < 0xFFFFFFFFUL) {
    ++counter;
  }
  EEPROM.put(kBootDiagnosticsOffset, kBootDiagnosticsMagic);
  EEPROM.put(kBootResetCounterOffset, counter);
  EEPROM.commit();
  return counter;
}

bool connectToSavedWifi(const WifiCredentials& creds) {
  Serial.printf("wifi_connect ssid=%s\n", creds.ssid);
  drawWifiConnectingStatus(creds.ssid);
  WiFi.mode(WIFI_STA);
  WiFi.begin(creds.ssid, creds.password);

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();
  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_connect_failed status=%d\n", static_cast<int>(WiFi.status()));
    return false;
  }

