DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  Serial.printf("wifi_connected ssid=%s ip=%s\n", creds.ssid, WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  return true;
}

bool connectToSdkWifiConfig() {
  WiFi.mode(WIFI_STA);
  const String ssid = WiFi.SSID();
  if (ssid.length() == 0) {
    Serial.println("wifi_sdk_config_missing");
    return false;
  }
  Serial.printf("wifi_sdk_connect ssid=%s\n", ssid.c_str());
  drawWifiConnectingStatus(ssid);
  WiFi.begin();

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();
  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_sdk_connect_failed status=%d\n", static_cast<int>(WiFi.status()));
    return false;
  }

  const String password = WiFi.psk();
  if (ssid.length() < kWifiSsidBytes && password.length() < kWifiPasswordBytes) {
    if (saveWifiCredentials(ssid, password)) {
      Serial.printf("wifi_sdk_credentials_imported ssid=%s\n", ssid.c_str());
    }
  }

  Serial.printf("wifi_connected source=sdk ssid=%s ip=%s\n", ssid.c_str(), WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  return true;
}

bool scanSetupNetworks() {
  using namespace codexbar_display::esp8266::wifi_setup;
  if (!BeginScan(setupWifiState)) {
    Serial.println("wifi_setup_scan_ignored reason=already_running");
    return false;
  }

  Serial.println("wifi_setup_scan_started");
  int networks = -2;
  WiFi.mode(setupMode ? WIFI_AP_STA : WIFI_STA);
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(false);
  delay(150);

  for (int attempt = 1; attempt <= 2; ++attempt) {
    networks = WiFi.scanNetworks(false, true);
    if (networks > 0) {
      break;
    }
    Serial.printf("wifi_setup_scan_empty attempt=%d networks=%d\n", attempt, networks);
    WiFi.scanDelete();
    delay(250);
    yield();
  }

  for (int i = 0; i < networks; ++i) {
    AddScanResult(setupWifiState, WiFi.SSID(i), WiFi.RSSI(i), WiFi.channel(i));
  }
  WiFi.scanDelete();
  FinishScan(setupWifiState, networks);
  if (setupMode) {
    WiFi.mode(WIFI_AP);
  }
  Serial.printf(
      "wifi_setup_scan_finished networks=%d visible=%u state=%u\n",
      networks,
      setupWifiState.networkCount,
      static_cast<unsigned int>(setupWifiState.scanStatus));
  return true;
}

String connectedPageHTML() {
  const String ip = WiFi.localIP().toString();
  const bool hasFrame = codexbar_display::app::HasFrame(runtimeCtx);

  String html;
  html.reserve(1500);
  html += F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'><title>VibeTV</title><style>");
  html += F("body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:24px;background:#0b0c0d;color:#f6f4ed}a{color:#c7ff00;font-weight:800}code,pre{background:#08090a;border:1px solid #30343a;padding:8px;display:block;white-space:pre-wrap;word-break:break-word}button,input{width:100%;font:inherit;margin-top:8px}button{padding:12px;background:#c7ff00;border:0;font-weight:900}section{border-top:1px solid #2b2f35;margin-top:16px;padding-top:12px}</style><h1>Vibe TV</h1>");
  html += F("<p>Connected<br><code>http://");
  html += ip;
  html += F("</code></p>");
  if (firmwareUpdate.available) {
    html += updateStatusHTML(true);
  }
  if (hasFrame) {
    html += F("<p>Live.</p>");
  } else {
    html += F("<section><h2>Next step</h2><p>Open <a href='");
    html += kCustomerAppUrl;
    html += F("'>");
    html += kCustomerAppHost;
    html += F("</a> on your Mac and follow the main button.</p></section>");
  }
  html += F("<p><a href='/health'>Status</a> <a href='/update'>Update</a></p>");
  html += F("<section><h2>Pairing</h2>");
  if (deviceAuthConfigured()) {
    html += F("<p class='muted'>Paired. Manage this VibeTV in Control Center.</p>");
  } else {
    html += F("<p class='muted'>Open Control Center to finish pairing after Wi-Fi setup.</p>");
  }
  html += F("</section>");
  return html;
}

void handleRoot() {
  webServer.keepAlive(false);
  if (setupMode) {
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::kSupportUrl,
        kSetupAddress);
    return;
  }
  webServer.send(200, "text/html; charset=utf-8", connectedPageHTML());
}

void redirectToSetupRoot() {
  webServer.keepAlive(false);
  webServer.sendHeader("Location", String("http://") + kSetupAddress + "/", true);
  webServer.send(302, "text/plain; charset=utf-8", "");
}

void handleCaptivePortalProbe() {
  webServer.keepAlive(false);
  if (setupMode) {
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::kSupportUrl,
        kSetupAddress);
    return;
  }
  redirectToSetupRoot();
}

void handleSaveWifi() {
  webServer.keepAlive(false);
  if (!authorizeWifiCredentialWrite()) {
    return;
  }
  String ssid = webServer.arg("custom_ssid");
  ssid.trim();
  if (ssid.length() == 0) {
    ssid = webServer.arg("ssid");
    ssid.trim();
  }
  String password = webServer.arg("password");
  if (ssid.length() == 0) {
    codexbar_display::esp8266::wifi_setup::SetConnectionError(
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::ConnectionError::MissingSsid);
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::kSupportUrl,
        kSetupAddress,
        400);
    return;
  }
  if (ssid.length() >= kWifiSsidBytes || password.length() >= kWifiPasswordBytes) {
    codexbar_display::esp8266::wifi_setup::SetConnectionError(
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::ConnectionError::InvalidCredentials);
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::kSupportUrl,
        kSetupAddress,
        400);
    return;
  }

  codexbar_display::esp8266::wifi_setup::ClearConnectionError(setupWifiState);
  if (!saveWifiCredentials(ssid, password)) {
    webServer.send(500, "text/plain; charset=utf-8", "WiFi settings could not be saved");
    return;
  }
  Serial.printf("wifi_credentials_saved ssid=%s\n", ssid.c_str());
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>Saved. Vibe TV is restarting.</p>");
  delay(500);
  clearSdkWifiCredentials();
  ESP.restart();
}

void handleSetupWifiScan() {
  webServer.keepAlive(false);
  if (!setupMode) {
    redirectToSetupRoot();
    return;
  }

  codexbar_display::esp8266::wifi_setup::ClearConnectionError(setupWifiState);
  scanSetupNetworks();
  webServer.sendHeader("Location", "/", true);
  webServer.send(303, "text/plain; charset=utf-8", "");
}

void handleResetWifi() {
  webServer.keepAlive(false);
  if (webServer.method() != HTTP_POST) {
    webServer.send(405, "text/plain; charset=utf-8", "method not allowed");
    return;
  }

  if (!authorizeWifiCredentialWrite()) {
    return;
  }

